// Напишете програма, която пресмята нужните разходи за закупуването на храна за кучета и котки.
// Храната се пазарува от зоомагазин, като една опаковка храна за кучета е на цена 2.50 лв, а опаковка храна за котки струва 4 лв.

//     Вход

// От конзолата се четат 2 реда:

// 1. Броят на опаковките храна за кучета – цяло число в интервала[0… 100]

// 2. Броят на опаковките храна за котки – цяло число в интервала[0… 100]

// Изход

// На конзолата се отпечатва:

// "{крайната сума} lv."


// Вход ["5 ","4 "] 
// Изход 28.5 lv. 


function petShop(input) {

    let foodDog = Number (input [0]); 
    let foodCat = Number(input[1]); 
    let finalFood;
    foodDog = foodDog * 2.50;
    foodCat = foodCat * 4;

    finalFood = foodCat + foodDog;

    console.log (`${finalFood} lv.`); 
}

    petShop(["5 ", "4 "]);